function plotData(X, y)
%
% PLOTDATA(x,y) отображает значения данных x и y в виде отдельного
%   изображения,создает подписи осей графиков, а также отображает метки
%   значений на осях графиков.
% open a new figure window

figure; hold on;

% ============= ВАШ КОД ЗДЕСЬ ==============
%
pos = find(y==1); neg = find(y == 0);
plot(X(pos, 1), X(pos, 2), 'b+');
plot(X(neg, 1), X(neg, 2), 'ro');
legend('Поломка', 'Исправлен');
xlabel('Шум');
ylabel('Неисправность вращения')
%
% =========================================================================

hold off;

end
